In [220]:
import numpy as np
import pandas as pd
import seaborn as sns

In [177]:
left = pd.DataFrame({'A': ['A0','A1','A2'],
                    'B': ['B0','B1','B2']},
                    index = ['K0','K1','K2'])
right = pd.DataFrame({'C': ['C0','C1','C2'],
                     'D': ['D0','D1','D2']},
                     index = ['K0','K2','K3'])

In [178]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [179]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [207]:
a = left.join(right,how='outer')
a.fillna('-') #fill blanks with a string or value

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1   -   -
K2  A2  B2  C1  D1
K3   -   -  C2  D2

In [181]:
print("a"*3)

aaa

In [187]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,555,444],
                  'col3': ['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   555  ghi
3     4   444  xyz

In [195]:
df['col2'].unique()
df['col1'].nunique()
df['col2'].value_counts()

555    2
444    2
Name: col2, dtype: int64

In [196]:
#conditional statement
df[df['col1']>2]

   col1  col2 col3
2     3   555  ghi
3     4   444  xyz

In [197]:
#multiple conditional statement AND
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [198]:
#multiple conditional statement OR
df[(df['col1']>2) | (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
2     3   555  ghi
3     4   444  xyz

In [202]:
#Applied Method for selection 
def times2(x): return x*2
df['col1']
df['col1'].apply(times2) #broadcast the function into each element of the column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [204]:
df['col3'].apply(len)  #len is an function that already exists in Python

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [205]:
df['col1'].apply(lambda x:x**2)  #creating a function on the spot using lambda function

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [211]:
df.columns #column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [212]:
df.index #index of column

RangeIndex(start=0, stop=4, step=1)

In [214]:
df.sort_values('col2')
df.sort_values(by = 'col2') #both return the same sorting

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   555  ghi

In [215]:
df.isnull()  #to find no value Nan

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [219]:
df.pivot_table(values = 'col2', index=['col3'], columns = ['col1'])

col1      1      2      3      4
col3
abc   444.0    NaN    NaN    NaN
def     NaN  555.0    NaN    NaN
ghi     NaN    NaN  555.0    NaN
xyz     NaN    NaN    NaN  444.0

In [221]:
titanic = sns.load_dataset('titanic')

In [222]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [224]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [226]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [227]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [230]:
#Pivot table
titanic.pivot_table('survived', index= 'sex', columns = 'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [231]:
#Multi level pivot table in rows
age = pd.cut(titanic['age'],[0,18,80])   #cut function can be useful for going from a continuous variable to a categorical variable
titanic.pivot_table('survived',index = ['sex',age],columns = 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [233]:
#multi level pivot table in columns
fare = pd.cut(titanic['fare'],2)
titanic.pivot_table('survived', index = ['sex',age], columns = ['class', fare]).fillna('-')

class                       First                               Second  \
fare            (-0.512, 256.165] (256.165, 512.329] (-0.512, 256.165]
sex    age
female (0, 18]           0.900000                  1          1.000000
       (18, 80]          0.971429                  1          0.900000
male   (0, 18]           0.800000                  -          0.600000
       (18, 80]          0.369565                0.5          0.071429

class                       Third
fare            (-0.512, 256.165]
sex    age
female (0, 18]           0.511628
       (18, 80]          0.423729
male   (0, 18]           0.215686
       (18, 80]          0.133663

In [238]:
# call signature as of Pandas 0.18
# DatFrame.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, 
#                      margins= False, dropna=True, margins_name='All')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [269]:
titanic.pivot_table('survived',index = ['sex','who'], columns = ['class'], aggfunc={'survived':sum}, margins =True)
#margins provides Totals

class         First  Second  Third    All
sex    who
female child    2.0    10.0   16.0   28.0
       woman   89.0    60.0   56.0  205.0
male   child    3.0     9.0    9.0   21.0
       man     42.0     8.0   38.0   88.0
All           136.0    87.0  119.0  342.0

In [278]:
abc = titanic['survived'].count()
abc

891

In [283]:
titanic.pivot_table('survived',index = ['sex','who'], columns = ['class'], aggfunc={'survived':'mean'}, margins =True)

class            First    Second     Third       All
sex    who
female child  0.666667  1.000000  0.533333  0.651163
       woman  0.978022  0.909091  0.491228  0.756458
male   child  1.000000  1.000000  0.321429  0.525000
       man    0.352941  0.080808  0.119122  0.163873
All           0.629630  0.472826  0.242363  0.383838

In [284]:
titanic.describe()  #gives a number of stat numbers for each column with values

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [303]:
a = pd.pivot_table(titanic, values = 'survived',index=['sex','who'],aggfunc={'survived':sum}, margins = True, columns =['class'])
b = pd.pivot_table(titanic, values = 'survived',index=['sex','who'],aggfunc={'survived':'count'}, margins = True, columns =['class'])

In [309]:
c = a/b  #a gives the sum and b gives the total count
c.round(3)

class         First  Second  Third    All
sex    who
female child  0.667   1.000  0.533  0.651
       woman  0.978   0.909  0.491  0.756
male   child  1.000   1.000  0.321  0.525
       man    0.353   0.081  0.119  0.164
All           0.630   0.473  0.242  0.384

In [340]:
def remove_outliers(values):  #function to remove outliers by quantile (Return values at the given quantile over requested axis, a la numpy.percentile)
    m = values.quantile([0.25,0.75])
    return np.mean(m)

pd.pivot_table(titanic, 'survived', index =['sex','who'], aggfunc=[np.mean, remove_outliers
                                                                   , lambda x:x.count()/3]).round(3)

                 mean remove_outliers <lambda>
             survived        survived survived
sex    who
female child    0.651             0.5   14.333
       woman    0.756             1.0   90.333
male   child    0.525             0.5   13.333
       man      0.164             0.0  179.000